//Составьте программу, выводящую на экран квадраты чисел от 10 до 20 включительно
package com.studing;

public class Main{
    public static void main(String[] args){
        for(int i = 10; i < 21; i++){
            System.out.println("Ответ: " + i * i);
        }
    }
}